my_dict = {"Александр" : 1989 , "Елена" : 1992, "Антон" : 1986, "Кристина" : 1989}
print("Словарь: " , my_dict)
print("Существующее значение: ", (my_dict["Антон"]))
print("Несуществующее значение: ", (my_dict.get("Олег", 'Такого значения нет')))
my_dict.update({"Дарья" : 1990, "Дмитрий" : 1991})
del_ = my_dict.pop("Елена")
print("Словарь с удаленным ключом: " , (my_dict))
print("Удаленное значение Елена: " , (del_))

my_set = {1, 1, 2, 4, 5, 8, "Строка", 3, 3, 2, 1, 1.2, False}
print("Множество: ", my_set)
my_set.add(666)
my_set.add("Еще одна строка")
my_set.discard(666)
print("Измененное множество: ", (my_set))